"""Файл - содержит ответы бота пользователю"""


START_MESSAGE = 'Привет {}! 👋 Выбери свою роль '
ACTION_MESSAGE = 'Выбери дальнейшие действия 😀'
EMPTY_COMMAND = 'Данной команды не существует! ☹'
HELP_MESSAGE = 'По любым вопросам пишите в телеграм @egorbuy 🙋‍♂️'
TITLE_MESSAGE = 'Введите описание задания 🖋'
PRICE_MESSAGE = 'Введите стоимость задания в рублях ₽'
INCORRECT_PRICE = 'Введена не корректная цена ❌'
TASK_COMPLETE = 'Ваш заказ успешно создан! ✅'
TASK_TEMPLATE = '{}\n\n*{}₽*\n\nКоличество откликов: {}'
TASK_TEMPLATE_CONTRACTORS = '{}\n\n*{}₽*'
EMPTY_TASK = 'У тебя пока нет заданий ☹'
TASK_DELETE = 'Задание удалено 👌'
RESP_TEMPLATE = '{}\n\n{}'
EMPTY_RESP = 'К сожалению, на заказ ещё никто не откликнулся ☹'
RESP_MESSAGE = 'Напишите свой отклик. ✍️\n' \
               '-Опишите суть предложения и что входит в стоимость работы.\n' \
               '-Если мало информации, напишите здесь вопросы, стоимость согласуете потом.'
EMPTY_TASKS = 'В данный момент заданий нет! 🤷‍♂️'
NEW_RESP_MESSAGE = '*У Вас новый отклик!* 🙌\n\n{}\n\n{}'
EMPTY_MY_RESP = 'Вы ещё не откликались на заказы ☹'
RESP_COMPLETE = 'Отклик успешно доставлен заказчику! 👌'
MY_RESP_TEMPLATE = '*Задание:*\n{}\n*Стоимость:* {}₽\n\n*Ваш отклик:*\n{}'
PHONE_WARNING = 'У Вас отсутствует username. Для дальнейшей работы установите username аккаунту, ' \
               'или введите номер телефона. Он будет необходим для связи заказчика с Вами.'
PHONE_INPUT = 'Ввести номер телефона:'
INCORRECT_PHONE = 'Введён некорректный номер телефона ❌'
PHONE_COMPLETE = 'Номер сохранён 👌'
CHOICES_TASKS = 'Найдено заданий: {}\nВыберите задания 😀'
